// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.

// let a= + prompt('Введіть число');
// let b= + prompt('Введіть число')
//
// if (a > b){
//     alert(a)
// } else if (a < b){
//     alert(b)
// } else if (a === b) {
//     alert('Числа рівні')
// }

//
//
// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

//
// let flat = + prompt('Введіть номер квартири від 1 до 90')
// if (flat >=1 && flat <= 20){
//     alert(`'Квартира №' ${flat} знаходиться в першому під'їзді`)
// } else if (flat >= 21 && flat <= 48){
//     alert(`'Квартира №' ${flat} знаходиться в другому під'їзді`)
// }else if (flat >=49 && flat <= 90) {
//     alert(`'Квартира №' ${flat} знаходиться в третьому під'їзді`)
// }

//
//
// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО,
// якщо змінна не рівна 10 - тоді НЕВІРНО

// let number = + prompt('Введіть число')
// if (number === 10){
//     alert('ВІРНО')
// } else {
//     alert('НЕВІРНО')
// }

//
// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else
//
// let x = 5;
// if (typeof x === 'number'){
//     document.writeln('1')
// } else if (typeof x === 'string'){
//     document.writeln('2')
// } else if (typeof x === 'boolean'){
//     document.writeln('3')
// } else if (typeof x === 'object'){
//     document.writeln('4')
// } else{
//     document.writeln('Щось не те введено')
// }



//
// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// let temperature = + prompt('Введіть яка температура сьогодні');
// if (temperature >=10 && temperature <=22){
//     alert('Йдемо ВЧИТИСЯ')
// } else {
//     alert('Cидимо вдома і вчимося ОНЛАЙН')
// }

//
//
// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
//
// let prize = + prompt('Введіть цифру від 1 до 5 та виграй приз')
// switch (prize){
//     case 1:
//         alert('Вітаю! Ви виграли авто');
//         break;
//     case 2:
//         alert('Вітаю! Ви виграли мотоцикл');
//         break;
//     case 3:
//         alert('Вітаю! Ви виграли телефон');
//         break;
//     case 4:
//         alert('Вітаю! Ви виграли ноутбук');
//         break;
//     case 5:
//         alert('Вітаю! Ви виграли квартиру');
//         break;
//     default:
//         alert('число не вірне ...')
// }