// Всі функції повинні бути описані стрілочним типом!!!!
//     - створити функцію яка обчислює та повертає площу прямокутника висотою

// let calc = (a,b) => a*b;
// console.log(calc(5, 6));

// - створити функцію яка обчислює та повертає площу кола

// let calc = (a) => Math.PI * Math.pow(a,2);
// console.log(calc(2))

// - створити функцію яка обчислює та повертає площу циліндру

let calc = (r,h) => 2 * Math.PI * r * h;

console.log(calc(2,3))

// - створити функцію яка приймає масив та виводить кожен його елемент

// let massif = [11, 22, 'name', true];
//
// let massifFn = (massif) => {
//        for (let i=0; i < massif.length; i++){
//               document.writeln(massif[i]);
//        }
// }
// massifFn(massif);

// let array = [1,2,3,4,5, 'hello world', 'okten'];
//
// const dataArray =  (array) => {
//     for (let i = 0; i < array.length; i++) {
//         console.log(array[i]);
//     }
// }
// dataArray(array);
// - створити функцію яка  створює параграф з текстом. Текст задати через аргумент
// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
//
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.