// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години
// попадає число
// (в першу, другу, третю или четверту частину години).

// let time = +prompt('Введіть число від 1 до 59');
//
// if(time <= 15){
//     console.log('Зараз 1 чверть години')
//
// } else if(time <= 30){
//     console.log('Зараз 2 чверть години')
//
// }else if(time <= 45){
//     console.log('Зараз 3 чверть години')
//
// } else if (time <=59){
//     console.log('Зараз 4 чверть години')
// }

//
//
// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

// let day = +prompt('Введіть число від 1 до 31')
// if (day <= 10){
//     console.log('Перша декада місяця')
// } else if (day <= 20){
//     console.log('Друга декада місяця')
// } else if (day <= 31){
//     console.log('Третя декада місяця')
// }
//
// - У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

// let test = false;
// if (test !== true) {
//     console.log('ВІРНО')
// } else {
//     console.log('НЕПРАВИЛЬНО')
// }
//
// (test !== true) ? console.log('ВІРНО'):console.log('НЕПРАВИЛЬНО');
// (test === true) ? console.log('НЕПРАВИЛЬНО'):console.log('ВІРНО');


//
// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

// let a = +prompt('Введіть число 1, 0 , -3');
// if (a !== 0){
//     console.log('ВІРНО')
// } else {
//     console.log('НЕВІРНО')
// }
//
// (+prompt('Введіть число 1, 0 , -3') !== 0) ? console.log('ВІРНО') : console.log('НЕВІРНО');
// (+prompt('Введіть число 1, 0 , -3') === 0) ? console.log('НЕВІРНО') : console.log('ВІРНО');


//
// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.

// let dayOfWeeks = +prompt('Введіть день тижня від 1 до 7')
// switch (dayOfWeeks) {
//     case 1:
//         alert('Понеділок: зробити те');
//         break;
//     case 2:
//         alert('Вівторок: зробити це');
//         break;
//     case 3:
//         alert('Середа: зробити ось це');
//         break;
//     case 4:
//         alert('Четвер: зробити ось те');
//         break;
//     case 5:
//         alert('П`ятниця - розвратниця ');
//         break;
//     case 6:
//         alert('Субота: прибирання');
//         break;
//     case 7:
//         alert('Неділя: відпочинок!');
//         break;
//     default:
//         alert("Hе то ввів");
// }

//
// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

// let year = + prompt('Введіть поточний рік');
//
// if(year % 4 === 0){
//     alert('Рік високосний');
// }else {
//     alert('Рік не високосний');
// }


//
// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

// let name = prompt('Яка «офіційна» назва JavaScript?');
// if(name === 'ECMAScript'){
//    alert('Правильно!');
// } else{
//    alert('Не знаєте? ECMAScript!');
// }

